v1.15.2 diagrams docs fix
